# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Color-highlighted diff(1) output
brew "colordiff"
# Emoji on the command-line :scream:
brew "emojify"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Simplistic interactive filtering tool
brew "peco"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Application launcher and productivity software
cask "alfred"
# Webcam & audio device software
cask "ankerwork"
# User-friendly GUI app for Homebrew
cask "applite"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Missing menulet for Homebrew
cask "brewlet"
# GUI companion app for Homebrew
cask "cork"
# Desktop client for GitHub repositories
cask "github"
# Japanese input software
cask "google-japanese-ime"
# Desktop automation application
cask "hammerspoon"
# Keyboard customiser
cask "karabiner-elements"
# Password manager
cask "lastpass"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Rust-based terminal
cask "warp"
mas "Display Menu", id: 549083868
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LensOCR", id: 1549961729
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Usage", id: 1561788435
vscode "ms-vscode.makefile-tools"
