tap "carlocab/personal"
tap "motemen/ghq"
brew "tree"
brew "ansible"
brew "emojify"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "go"
brew "htop"
brew "hub"
brew "jq"
brew "mysql"
brew "node"
brew "peco"
brew "reattach-to-user-namespace"
brew "stow"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "trash", link: true
brew "vim"
brew "wget"
brew "carlocab/personal/unrar"
cask "alfred"
cask "applite"
cask "bettertouchtool"
cask "brewlet"
cask "claude"
cask "cork"
cask "dash"
cask "docker-desktop"
cask "dropbox"
cask "evernote"
cask "github"
cask "google-chrome"
cask "google-japanese-ime"
cask "lastpass"
cask "obsidian"
cask "phpstorm"
cask "postman"
cask "slack"
cask "vagrant"
cask "virtualbox"
