brew "emojify"
brew "gh"
brew "ghq"
brew "git"
brew "peco"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "trash", link: true
brew "tree"
brew "vim"
cask "alfred"
cask "applite"
cask "bettertouchtool"
cask "brewlet"
cask "cork"
cask "github"
cask "google-japanese-ime"
cask "lastpass"
cask "obsidian"
