--[[
  共通のNeovim設定
  必ずinit.luaの最初で読み込むこと

  含まれる設定:
    - テキスト選択(textobject)
    - テキスト移動(motions)
    - テキスト編集(operator)
    - Leaderキー
]]

--[[
-------------------------------------------------------------------------------
--                           テキスト選択                                    --
-------------------------------------------------------------------------------
--]]
vim.opt.clipboard = "unnamedplus" -- クリップボードをOSと同期(yankでクリップボードにコピーされる)
vim.opt.selection = "inclusive"   -- カーソル位置の文字も選択対象にする


--[[
-------------------------------------------------------------------------------
--                           テキスト移動                                    --
-------------------------------------------------------------------------------
--]]
-- 検索
vim.opt.ignorecase = true  -- 検索時に大文字/小文字を区別しない
vim.opt.smartcase = true   -- 大文字を含む検索したときは区別する
vim.opt.hlsearch = true    -- 検索結果をハイライトする
vim.opt.incsearch = true   -- インクリメンタルサーチを有効化(リアルタイムの絞り込み検索)
vim.opt.startofline = true -- 移動時に行頭に移動する


--[[
-------------------------------------------------------------------------------
--                           テキスト編集                                    --
-------------------------------------------------------------------------------
--]]
vim.opt.autoindent = true -- 前の行のインデントを引き継ぐ


--[[
-------------------------------------------------------------------------------
--                           Leaderキー                                      --
-------------------------------------------------------------------------------
--]]
local half_space = " "
vim.g.mapleader = half_space -- Leaderキーの設定
